MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0518LD2AE/mcu.h
    /**
     * BPWM_FCAPDAT4
     * ===================================================================================================
     * Offset: 0x230  BPWM Falling Capture Data Register 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |FCAPDAT   |BPWM Falling Capture Data Register (Read Only)
     * |        |          |When falling capture condition happened, the BPWM counter value will be saved in this register.
     */
    __IO uint32_t FCAPDAT4;

    /**
     * BPWM_RCAPDAT5
     * ===================================================================================================
     * Offset: 0x234  BPWM Rising Capture Data Register 5
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |RCAPDAT   |BPWM Rising Capture Data Register (Read Only)
     * |        |          |When rising capture condition happened, the BPWM counter value will be saved in this register.
     */
    __IO uint32_t RCAPDAT5;

    /**
     * BPWM_FCAPDAT5
     * ===================================================================================================
     * Offset: 0x238  BPWM Falling Capture Data Register 5
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |FCAPDAT   |BPWM Falling Capture Data Register (Read Only)
     * |        |          |When falling capture condition happened, the BPWM counter value will be saved in this register.
     */
    __IO uint32_t FCAPDAT5;

    /**
     * @cond HIDDEN_SYMBOLS
     * RESERVED13
     * ===================================================================================================
     * Offset: 0x023C ~ 0x024C
     * ---------------------------------------------------------------------------------------------------
     */
    __I  uint32_t RESERVED13[5];
    /**
     * @endcond
     */

    /**
     * BPWM_CAPIEN
     * ===================================================================================================
     * Offset: 0x250  BPWM Capture Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |CAPRIENn  |BPWM Capture Rising Latch Interrupt Enable
     * |        |          |Each bit n controls the corresponding BPWM channel n.
     * |        |          |0 = Capture rising edge latch interrupt Disabled.
     * |        |          |1 = Capture rising edge latch interrupt Enabled.
     * |[13:8]  |CAPFIENn  |BPWM Capture Falling Latch Interrupt Enable
     * |        |          |Each bit n controls the corresponding BPWM channel n.
     * |        |          |0 = Capture falling edge latch interrupt Disabled.
     * |        |          |1 = Capture falling edge latch interrupt Enabled.
     */
    __IO uint32_t CAPIEN;


    /**
     * BPWM_CAPIF
     * ===================================================================================================
     * Offset: 0x254  BPWM Capture Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |CAPRIFn   |BPWM Capture Rising Latch Interrupt Flag
     * |        |          |This bit is writing 1 to clear. Each bit n controls the corresponding BPWM channel n.
     * |        |          |0 = No capture rising latch condition happened.
     * |        |          |1 = Capture rising latch condition happened, this flag will be set to high.
     * |[13:8]  |CAPFIFn   |BPWM Capture Falling Latch Interrupt Flag
     * |        |          |This bit is writing 1 to clear. Each bit n controls the corresponding BPWM channel n.
     * |        |          |0 = No capture falling latch condition happened.
     * |        |          |1 = Capture falling latch condition happened, this flag will be set to high.
     */
    __IO uint32_t CAPIF;

    /**
     * @cond HIDDEN_SYMBOLS
     * RESERVED14
     * ===================================================================================================
     * Offset: 0x0258 ~ 0x0300
     * ---------------------------------------------------------------------------------------------------
     */
    __I  uint32_t RESERVED14[43];
    /**
     * @endcond
     */

    /**
     * BPWM_PBUF
     * ===================================================================================================
     * Offset: 0x304  BPWM PERIOD Buffer
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PBUF      |BPWM Period Register Buffer (Read Only)
     * |        |          |Used as PERIOD active register.
     */
    __I  uint32_t PBUF;

    /**
     * @cond HIDDEN_SYMBOLS
     * RESERVED15
     * ===================================================================================================
     * Offset: 0x0308 ~ 0x0318
     * ---------------------------------------------------------------------------------------------------
     */
    __I  uint32_t RESERVED15[5];
    /**
     * @endcond
     */

    /**
     * BPWM_CMPBUF0~5
     * ===================================================================================================
     * Offset: 0x31C~0x330  BPWM CMP0~5 Buffer
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |CMPBUF    |BPWM Comparator Register Buffer (Read Only)
     * |        |          |Used as CMP active register.
     */
    __I  uint32_t CMPBUF[6];

    /**
     * @cond HIDDEN_SYMBOLS
     * RESERVED16
     * ===================================================================================================
     * Offset: 0x0334 ~ 0x0FFC
     * ---------------------------------------------------------------------------------------------------
     */
    __I  uint32_t RESERVED16[819];
    /**
     * @endcond
     */
} BPWM_T;

/**
    @addtogroup BPWM_CONST BPWM Bit Field Definition
    Constant Definitions for BPWM Controller
@{ */

#define BPWM_CTL0_CTRLDn_Pos             (0)                                                /*!< BPWM_T::CTL0: CTRLDn Position              */
#define BPWM_CTL0_CTRLDn_Msk             (0x3ful << BPWM_CTL0_CTRLDn_Pos)                   /*!< BPWM_T::CTL0: CTRLDn Mask                  */

#define BPWM_CTL0_CTRLD0_Pos             (0)                                                /*!< BPWM_T::CTL0: CTRLD0 Position              */
#define BPWM_CTL0_CTRLD0_Msk             (0x1ul << BPWM_CTL0_CTRLD0_Pos)                    /*!< BPWM_T::CTL0: CTRLD0 Mask                  */

#define BPWM_CTL0_CTRLD1_Pos             (1)                                                /*!< BPWM_T::CTL0: CTRLD1 Position              */
#define BPWM_CTL0_CTRLD1_Msk             (0x1ul << BPWM_CTL0_CTRLD1_Pos)                    /*!< BPWM_T::CTL0: CTRLD1 Mask                  */

