MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0518LD2AE/mcu.h
#define BPWM_MSK_MSKDAT5_Pos             (5)                                                /*!< BPWM_T::MSK: MSKDAT5 Position              */
#define BPWM_MSK_MSKDAT5_Msk             (0x1ul << BPWM_MSK_MSKDAT5_Pos)                    /*!< BPWM_T::MSK: MSKDAT5 Mask                  */

#define BPWM_POLCTL_PINVn_Pos            (0)                                                /*!< BPWM_T::POLCTL: PINVn Position             */
#define BPWM_POLCTL_PINVn_Msk            (0x3ful << BPWM_POLCTL_PINVn_Pos)                  /*!< BPWM_T::POLCTL: PINVn Mask                 */

#define BPWM_POLCTL_PINV0_Pos            (0)                                                /*!< BPWM_T::POLCTL: PINV0 Position             */
#define BPWM_POLCTL_PINV0_Msk            (0x1ul << BPWM_POLCTL_PINV0_Pos)                   /*!< BPWM_T::POLCTL: PINV0 Mask                 */

#define BPWM_POLCTL_PINV1_Pos            (1)                                                /*!< BPWM_T::POLCTL: PINV1 Position             */
#define BPWM_POLCTL_PINV1_Msk            (0x1ul << BPWM_POLCTL_PINV1_Pos)                   /*!< BPWM_T::POLCTL: PINV1 Mask                 */

#define BPWM_POLCTL_PINV2_Pos            (2)                                                /*!< BPWM_T::POLCTL: PINV2 Position             */
#define BPWM_POLCTL_PINV2_Msk            (0x1ul << BPWM_POLCTL_PINV2_Pos)                   /*!< BPWM_T::POLCTL: PINV2 Mask                 */

#define BPWM_POLCTL_PINV3_Pos            (3)                                                /*!< BPWM_T::POLCTL: PINV3 Position             */
#define BPWM_POLCTL_PINV3_Msk            (0x1ul << BPWM_POLCTL_PINV3_Pos)                   /*!< BPWM_T::POLCTL: PINV3 Mask                 */

#define BPWM_POLCTL_PINV4_Pos            (4)                                                /*!< BPWM_T::POLCTL: PINV4 Position             */
#define BPWM_POLCTL_PINV4_Msk            (0x1ul << BPWM_POLCTL_PINV4_Pos)                   /*!< BPWM_T::POLCTL: PINV4 Mask                 */

#define BPWM_POLCTL_PINV5_Pos            (5)                                                /*!< BPWM_T::POLCTL: PINV5 Position             */
#define BPWM_POLCTL_PINV5_Msk            (0x1ul << BPWM_POLCTL_PINV5_Pos)                   /*!< BPWM_T::POLCTL: PINV5 Mask                 */

#define BPWM_POEN_POENn_Pos              (0)                                                /*!< BPWM_T::POEN: POENn Position               */
#define BPWM_POEN_POENn_Msk              (0x3ful << BPWM_POEN_POENn_Pos)                    /*!< BPWM_T::POEN: POENn Mask                   */

#define BPWM_POEN_POEN0_Pos              (0)                                                /*!< BPWM_T::POEN: POEN0 Position               */
#define BPWM_POEN_POEN0_Msk              (0x1ul << BPWM_POEN_POEN0_Pos)                     /*!< BPWM_T::POEN: POEN0 Mask                   */

#define BPWM_POEN_POEN1_Pos              (1)                                                /*!< BPWM_T::POEN: POEN1 Position               */
#define BPWM_POEN_POEN1_Msk              (0x1ul << BPWM_POEN_POEN1_Pos)                     /*!< BPWM_T::POEN: POEN1 Mask                   */

#define BPWM_POEN_POEN2_Pos              (2)                                                /*!< BPWM_T::POEN: POEN2 Position               */
#define BPWM_POEN_POEN2_Msk              (0x1ul << BPWM_POEN_POEN2_Pos)                     /*!< BPWM_T::POEN: POEN2 Mask                   */

#define BPWM_POEN_POEN3_Pos              (3)                                                /*!< BPWM_T::POEN: POEN3 Position               */
#define BPWM_POEN_POEN3_Msk              (0x1ul << BPWM_POEN_POEN3_Pos)                     /*!< BPWM_T::POEN: POEN3 Mask                   */

#define BPWM_POEN_POEN4_Pos              (4)                                                /*!< BPWM_T::POEN: POEN4 Position               */
#define BPWM_POEN_POEN4_Msk              (0x1ul << BPWM_POEN_POEN4_Pos)                     /*!< BPWM_T::POEN: POEN4 Mask                   */

#define BPWM_POEN_POEN5_Pos              (5)                                                /*!< BPWM_T::POEN: POEN5 Position               */
#define BPWM_POEN_POEN5_Msk              (0x1ul << BPWM_POEN_POEN5_Pos)                     /*!< BPWM_T::POEN: POEN5 Mask                   */

#define BPWM_INTEN_ZIEN0_Pos             (0)                                                /*!< BPWM_T::INTEN: ZIEN0 Position              */
#define BPWM_INTEN_ZIEN0_Msk             (0x1ul << BPWM_INTEN_ZIEN0_Pos)                    /*!< BPWM_T::INTEN: ZIEN0 Mask                  */

#define BPWM_INTEN_PIEN0_Pos             (8)                                                /*!< BPWM_T::INTEN: PIEN0 Position              */
#define BPWM_INTEN_PIEN0_Msk             (0x1ul << BPWM_INTEN_PIEN0_Pos)                    /*!< BPWM_T::INTEN: PIEN0 Mask                  */

#define BPWM_INTEN_CMPUIENn_Pos          (16)                                               /*!< BPWM_T::INTEN: CMPUIENn Position           */
#define BPWM_INTEN_CMPUIENn_Msk          (0x3ful << BPWM_INTEN_CMPUIENn_Pos)                /*!< BPWM_T::INTEN: CMPUIENn Mask               */

#define BPWM_INTEN_CMPUIEN0_Pos          (16)                                               /*!< BPWM_T::INTEN: CMPUIEN0 Position           */
#define BPWM_INTEN_CMPUIEN0_Msk          (0x1ul << BPWM_INTEN_CMPUIEN0_Pos)                 /*!< BPWM_T::INTEN: CMPUIEN0 Mask               */

#define BPWM_INTEN_CMPUIEN1_Pos          (17)                                               /*!< BPWM_T::INTEN: CMPUIEN1 Position           */
#define BPWM_INTEN_CMPUIEN1_Msk          (0x1ul << BPWM_INTEN_CMPUIEN1_Pos)                 /*!< BPWM_T::INTEN: CMPUIEN1 Mask               */

#define BPWM_INTEN_CMPUIEN2_Pos          (18)                                               /*!< BPWM_T::INTEN: CMPUIEN2 Position           */
#define BPWM_INTEN_CMPUIEN2_Msk          (0x1ul << BPWM_INTEN_CMPUIEN2_Pos)                 /*!< BPWM_T::INTEN: CMPUIEN2 Mask               */

#define BPWM_INTEN_CMPUIEN3_Pos          (19)                                               /*!< BPWM_T::INTEN: CMPUIEN3 Position           */
#define BPWM_INTEN_CMPUIEN3_Msk          (0x1ul << BPWM_INTEN_CMPUIEN3_Pos)                 /*!< BPWM_T::INTEN: CMPUIEN3 Mask               */

#define BPWM_INTEN_CMPUIEN4_Pos          (20)                                               /*!< BPWM_T::INTEN: CMPUIEN4 Position           */
#define BPWM_INTEN_CMPUIEN4_Msk          (0x1ul << BPWM_INTEN_CMPUIEN4_Pos)                 /*!< BPWM_T::INTEN: CMPUIEN4 Mask               */

#define BPWM_INTEN_CMPUIEN5_Pos          (21)                                               /*!< BPWM_T::INTEN: CMPUIEN5 Position           */
#define BPWM_INTEN_CMPUIEN5_Msk          (0x1ul << BPWM_INTEN_CMPUIEN5_Pos)                 /*!< BPWM_T::INTEN: CMPUIEN5 Mask               */

#define BPWM_INTEN_CMPDIENn_Pos          (24)                                               /*!< BPWM_T::INTEN: CMPDIENn Position           */
#define BPWM_INTEN_CMPDIENn_Msk          (0x3ful << BPWM_INTEN_CMPDIENn_Pos)                /*!< BPWM_T::INTEN: CMPDIENn Mask               */

#define BPWM_INTEN_CMPDIEN0_Pos          (24)                                               /*!< BPWM_T::INTEN: CMPDIEN0 Position           */
#define BPWM_INTEN_CMPDIEN0_Msk          (0x1ul << BPWM_INTEN_CMPDIEN0_Pos)                 /*!< BPWM_T::INTEN: CMPDIEN0 Mask               */

#define BPWM_INTEN_CMPDIEN1_Pos          (25)                                               /*!< BPWM_T::INTEN: CMPDIEN1 Position           */
#define BPWM_INTEN_CMPDIEN1_Msk          (0x1ul << BPWM_INTEN_CMPDIEN1_Pos)                 /*!< BPWM_T::INTEN: CMPDIEN1 Mask               */

#define BPWM_INTEN_CMPDIEN2_Pos          (26)                                               /*!< BPWM_T::INTEN: CMPDIEN2 Position           */
#define BPWM_INTEN_CMPDIEN2_Msk          (0x1ul << BPWM_INTEN_CMPDIEN2_Pos)                 /*!< BPWM_T::INTEN: CMPDIEN2 Mask               */

#define BPWM_INTEN_CMPDIEN3_Pos          (27)                                               /*!< BPWM_T::INTEN: CMPDIEN3 Position           */
#define BPWM_INTEN_CMPDIEN3_Msk          (0x1ul << BPWM_INTEN_CMPDIEN3_Pos)                 /*!< BPWM_T::INTEN: CMPDIEN3 Mask               */

